arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/hal/src/pmc/fsl_pmc_hal.c
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_pmc_hal.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : PMC_HAL_SetLowVoltIntCmd
 * Description   : Enable/Disable low voltage related interrupts
 * This function  enables  the the low voltage detection, warning, etc. interrupts. 
 * When enabled, if the LVDF (Low Voltage Detect Flag) is set, a hardware 
 * interrupt occurs.
 * 
 *END**************************************************************************/
void PMC_HAL_SetLowVoltIntCmd(PMC_Type* const baseAddr, const pmc_int_select_t intSelect, const bool enable)
{
  switch (intSelect)
  {
    case PMC_INT_LOW_VOLT_DETECT:    /* Low Voltage Detect */
      BITBAND_ACCESS32(&(baseAddr->LVDSC1), PMC_LVDSC1_LVDIE_SHIFT) = enable;
      break;
    case PMC_INT_LOW_VOLT_WARN:      /* Low Voltage Warning */
      BITBAND_ACCESS32(&(baseAddr->LVDSC2), PMC_LVDSC2_LVWIE_SHIFT) = enable;
      break;
    default:
      /* invalid command */
      break;
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : PMC_HAL_SetLowVoltIntAckCmd
 * Description   : Acknowledges low voltage related interrupts
 * This function acknowledges the low voltage detection, warning, 
 * etc. interrupts
 * 
 *END**************************************************************************/
void PMC_HAL_SetLowVoltIntAckCmd(PMC_Type* const baseAddr, const pmc_int_select_t intSelect)
{
  switch (intSelect)
  {
    case PMC_INT_LOW_VOLT_DETECT:    /* Low Voltage Detect */
      BITBAND_ACCESS32(&(baseAddr->LVDSC1), PMC_LVDSC1_LVDACK_SHIFT) = 1;
      break;
    case PMC_INT_LOW_VOLT_WARN:      /* Low Voltage Warning */
      BITBAND_ACCESS32(&(baseAddr->LVDSC2), PMC_LVDSC2_LVWACK_SHIFT) = 1;
      break;
    default:
     /* invalid command */
      break;
  }
}

/*FUNCTION**********************************************************************
 *
 * Function Name : PMC_HAL_GetLowVoltIntFlag
 * Description   : Returns the flag for low voltage related interrupts
 * This function returns the flag for the low voltage detection, warning, 
 * etc. interrupts
 * 
 *END**************************************************************************/
bool PMC_HAL_GetLowVoltIntFlag(const PMC_Type* const baseAddr, const pmc_int_select_t intSelect)
{   
  bool flag;
  switch (intSelect)
  {
    case PMC_INT_LOW_VOLT_DETECT:    /* Low Voltage Detect */
      flag = BITBAND_ACCESS32(&(baseAddr->LVDSC1), PMC_LVDSC1_LVDF_SHIFT);
      break;
    case PMC_INT_LOW_VOLT_WARN:      /* Low Voltage Warning */
      flag = BITBAND_ACCESS32(&(baseAddr->LVDSC2), PMC_LVDSC2_LVWF_SHIFT);
      break;
    default:
      flag = false;
      break;
  }
  return flag;
}



/*******************************************************************************
 * EOF
 ******************************************************************************/

